__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
main_input2 (InputLayer)        (None, 240, 240, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_63 (ZeroPadding2 (None, 242, 242, 3)  0           main_input2[0][0]                
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 240, 240, 64) 1792        zero_padding2d_63[0][0]          
__________________________________________________________________________________________________
zero_padding2d_64 (ZeroPadding2 (None, 242, 242, 64) 0           conv2d_57[0][0]                  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 240, 240, 64) 36928       zero_padding2d_64[0][0]          
__________________________________________________________________________________________________
zero_padding2d_65 (ZeroPadding2 (None, 242, 242, 64) 0           conv2d_58[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 120, 120, 64) 0           zero_padding2d_65[0][0]          
__________________________________________________________________________________________________
zero_padding2d_66 (ZeroPadding2 (None, 122, 122, 64) 0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 120, 120, 128 73856       zero_padding2d_66[0][0]          
__________________________________________________________________________________________________
zero_padding2d_67 (ZeroPadding2 (None, 122, 122, 128 0           conv2d_59[0][0]                  
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 120, 120, 128 147584      zero_padding2d_67[0][0]          
__________________________________________________________________________________________________
zero_padding2d_68 (ZeroPadding2 (None, 122, 122, 128 0           conv2d_60[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 60, 60, 128)  0           zero_padding2d_68[0][0]          
__________________________________________________________________________________________________
zero_padding2d_69 (ZeroPadding2 (None, 62, 62, 128)  0           max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 60, 60, 256)  295168      zero_padding2d_69[0][0]          
__________________________________________________________________________________________________
zero_padding2d_70 (ZeroPadding2 (None, 62, 62, 256)  0           conv2d_61[0][0]                  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 60, 60, 256)  590080      zero_padding2d_70[0][0]          
__________________________________________________________________________________________________
zero_padding2d_71 (ZeroPadding2 (None, 62, 62, 256)  0           conv2d_62[0][0]                  
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 60, 60, 256)  590080      zero_padding2d_71[0][0]          
__________________________________________________________________________________________________
zero_padding2d_72 (ZeroPadding2 (None, 62, 62, 256)  0           conv2d_63[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 30, 30, 256)  0           zero_padding2d_72[0][0]          
__________________________________________________________________________________________________
zero_padding2d_73 (ZeroPadding2 (None, 32, 32, 256)  0           max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 30, 30, 512)  1180160     zero_padding2d_73[0][0]          
__________________________________________________________________________________________________
zero_padding2d_74 (ZeroPadding2 (None, 32, 32, 512)  0           conv2d_64[0][0]                  
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 30, 30, 512)  2359808     zero_padding2d_74[0][0]          
__________________________________________________________________________________________________
zero_padding2d_75 (ZeroPadding2 (None, 32, 32, 512)  0           conv2d_65[0][0]                  
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 30, 30, 512)  2359808     zero_padding2d_75[0][0]          
__________________________________________________________________________________________________
zero_padding2d_76 (ZeroPadding2 (None, 32, 32, 512)  0           conv2d_66[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 15, 15, 512)  0           zero_padding2d_76[0][0]          
__________________________________________________________________________________________________
zero_padding2d_77 (ZeroPadding2 (None, 19, 19, 512)  0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 15, 15, 512)  2359808     zero_padding2d_77[0][0]          
__________________________________________________________________________________________________
zero_padding2d_78 (ZeroPadding2 (None, 19, 19, 512)  0           conv2d_67[0][0]                  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 15, 15, 512)  2359808     zero_padding2d_78[0][0]          
__________________________________________________________________________________________________
zero_padding2d_79 (ZeroPadding2 (None, 19, 19, 512)  0           conv2d_68[0][0]                  
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 15, 15, 512)  2359808     zero_padding2d_79[0][0]          
__________________________________________________________________________________________________
zero_padding2d_80 (ZeroPadding2 (None, 17, 17, 512)  0           conv2d_69[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 15, 15, 512)  0           zero_padding2d_80[0][0]          
__________________________________________________________________________________________________
zero_padding2d_81 (ZeroPadding2 (None, 39, 39, 512)  0           max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 15, 15, 1024) 4719616     zero_padding2d_81[0][0]          
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 15, 15, 1024) 0           conv2d_70[0][0]                  
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 15, 15, 1024) 1049600     dropout_5[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 15, 15, 1024) 0           conv2d_71[0][0]                  
__________________________________________________________________________________________________
zero_padding2d_82 (ZeroPadding2 (None, 17, 17, 1024) 0           dropout_6[0][0]                  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 15, 15, 64)   589888      zero_padding2d_82[0][0]          
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 15, 15, 64)   65600       dropout_6[0][0]                  
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 15, 15, 64)   4160        conv2d_73[0][0]                  
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 15, 15, 64)   4160        conv2d_72[0][0]                  
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 15, 15, 128)  0           dense_28[0][0]                   
                                                                 dense_27[0][0]                   
__________________________________________________________________________________________________
zero_padding2d_84 (ZeroPadding2 (None, 17, 17, 512)  0           max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
zero_padding2d_83 (ZeroPadding2 (None, 17, 17, 128)  0           concatenate_13[0][0]             
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 15, 15, 64)   294976      zero_padding2d_84[0][0]          
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 15, 15, 64)   73792       zero_padding2d_83[0][0]          
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 15, 15, 64)   4160        conv2d_75[0][0]                  
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 15, 15, 64)   4160        conv2d_74[0][0]                  
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 15, 15, 128)  0           dense_30[0][0]                   
                                                                 dense_29[0][0]                   
__________________________________________________________________________________________________
zero_padding2d_86 (ZeroPadding2 (None, 17, 17, 512)  0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
zero_padding2d_85 (ZeroPadding2 (None, 17, 17, 128)  0           concatenate_14[0][0]             
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 15, 15, 64)   294976      zero_padding2d_86[0][0]          
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 15, 15, 64)   73792       zero_padding2d_85[0][0]          
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 15, 15, 64)   4160        conv2d_77[0][0]                  
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 15, 15, 64)   4160        conv2d_76[0][0]                  
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 15, 15, 128)  0           dense_32[0][0]                   
                                                                 dense_31[0][0]                   
__________________________________________________________________________________________________
zero_padding2d_87 (ZeroPadding2 (None, 17, 17, 128)  0           concatenate_15[0][0]             
__________________________________________________________________________________________________
zero_padding2d_88 (ZeroPadding2 (None, 32, 32, 256)  0           max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 15, 15, 64)   73792       zero_padding2d_87[0][0]          
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 30, 30, 64)   147520      zero_padding2d_88[0][0]          
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 15, 15, 64)   4160        conv2d_78[0][0]                  
__________________________________________________________________________________________________
dense_34 (Dense)                (None, 30, 30, 64)   4160        conv2d_79[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 30, 30, 64)   0           dense_33[0][0]                   
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 30, 30, 128)  0           dense_34[0][0]                   
                                                                 up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
zero_padding2d_89 (ZeroPadding2 (None, 32, 32, 128)  0           concatenate_16[0][0]             
__________________________________________________________________________________________________
zero_padding2d_90 (ZeroPadding2 (None, 62, 62, 128)  0           max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 30, 30, 64)   73792       zero_padding2d_89[0][0]          
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 60, 60, 64)   73792       zero_padding2d_90[0][0]          
__________________________________________________________________________________________________
dense_35 (Dense)                (None, 30, 30, 64)   4160        conv2d_80[0][0]                  
__________________________________________________________________________________________________
dense_36 (Dense)                (None, 60, 60, 64)   4160        conv2d_81[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 60, 60, 64)   65600       dense_35[0][0]                   
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 60, 60, 128)  0           dense_36[0][0]                   
                                                                 conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
zero_padding2d_91 (ZeroPadding2 (None, 62, 62, 128)  0           concatenate_17[0][0]             
__________________________________________________________________________________________________
zero_padding2d_92 (ZeroPadding2 (None, 122, 122, 64) 0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 60, 60, 64)   73792       zero_padding2d_91[0][0]          
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 120, 120, 64) 36928       zero_padding2d_92[0][0]          
__________________________________________________________________________________________________
dense_37 (Dense)                (None, 60, 60, 64)   4160        conv2d_82[0][0]                  
__________________________________________________________________________________________________
dense_38 (Dense)                (None, 120, 120, 64) 4160        conv2d_83[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 120, 120, 64) 65600       dense_37[0][0]                   
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 120, 120, 128 0           dense_38[0][0]                   
                                                                 conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
zero_padding2d_93 (ZeroPadding2 (None, 122, 122, 128 0           concatenate_18[0][0]             
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 120, 120, 64) 73792       zero_padding2d_93[0][0]          
__________________________________________________________________________________________________
dense_39 (Dense)                (None, 120, 120, 64) 4160        conv2d_84[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 240, 240, 64) 65600       dense_39[0][0]                   
==================================================================================================
Total params: 22,681,216
Trainable params: 22,681,216
Non-trainable params: 0
__________________________________________________________________________________________________
None
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
main_input2 (InputLayer)     (None, 240, 240, 3)       0         
_________________________________________________________________
zero_padding2d_63 (ZeroPaddi (None, 242, 242, 3)       0         
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 240, 240, 64)      1792      
_________________________________________________________________
zero_padding2d_64 (ZeroPaddi (None, 242, 242, 64)      0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 240, 240, 64)      36928     
_________________________________________________________________
zero_padding2d_65 (ZeroPaddi (None, 242, 242, 64)      0         
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 120, 120, 64)      0         
_________________________________________________________________
zero_padding2d_66 (ZeroPaddi (None, 122, 122, 64)      0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 120, 120, 128)     73856     
_________________________________________________________________
zero_padding2d_67 (ZeroPaddi (None, 122, 122, 128)     0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 120, 120, 128)     147584    
_________________________________________________________________
zero_padding2d_68 (ZeroPaddi (None, 122, 122, 128)     0         
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 60, 60, 128)       0         
_________________________________________________________________
zero_padding2d_69 (ZeroPaddi (None, 62, 62, 128)       0         
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 60, 60, 256)       295168    
_________________________________________________________________
zero_padding2d_70 (ZeroPaddi (None, 62, 62, 256)       0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 60, 60, 256)       590080    
_________________________________________________________________
zero_padding2d_71 (ZeroPaddi (None, 62, 62, 256)       0         
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 60, 60, 256)       590080    
_________________________________________________________________
zero_padding2d_72 (ZeroPaddi (None, 62, 62, 256)       0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 30, 30, 256)       0         
_________________________________________________________________
zero_padding2d_73 (ZeroPaddi (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_64 (Conv2D)           (None, 30, 30, 512)       1180160   
_________________________________________________________________
zero_padding2d_74 (ZeroPaddi (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 30, 30, 512)       2359808   
_________________________________________________________________
zero_padding2d_75 (ZeroPaddi (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 30, 30, 512)       2359808   
_________________________________________________________________
zero_padding2d_76 (ZeroPaddi (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 30, 30, 512)       0         
_________________________________________________________________
zero_padding2d_77 (ZeroPaddi (None, 34, 34, 512)       0         
_________________________________________________________________
conv2d_67 (Conv2D)           (None, 30, 30, 512)       2359808   
_________________________________________________________________
zero_padding2d_78 (ZeroPaddi (None, 34, 34, 512)       0         
_________________________________________________________________
conv2d_68 (Conv2D)           (None, 30, 30, 512)       2359808   
_________________________________________________________________
zero_padding2d_79 (ZeroPaddi (None, 34, 34, 512)       0         
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 30, 30, 512)       2359808   
_________________________________________________________________
zero_padding2d_80 (ZeroPaddi (None, 32, 32, 512)       0         
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 30, 30, 512)       0         
_________________________________________________________________
zero_padding2d_81 (ZeroPaddi (None, 54, 54, 512)       0         
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 30, 30, 1024)      4719616   
_________________________________________________________________
dropout_5 (Dropout)          (None, 30, 30, 1024)      0         
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 30, 30, 1024)      1049600   
_________________________________________________________________
dropout_6 (Dropout)          (None, 30, 30, 1024)      0         
=================================================================
Total params: 20,483,904
Trainable params: 20,483,904
Non-trainable params: 0
_________________________________________________________________
None
