__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
main_input (InputLayer)         (None, 320, 320, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 322, 322, 3)  0           main_input[0][0]                 
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 320, 320, 64) 1792        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 322, 322, 64) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 320, 320, 64) 36928       zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 322, 322, 64) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 160, 160, 64) 0           zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 162, 162, 64) 0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 160, 160, 128 73856       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 162, 162, 128 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 160, 160, 128 147584      zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 162, 162, 128 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 80, 80, 128)  0           zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 82, 82, 128)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 80, 80, 256)  295168      zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 82, 82, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 80, 80, 256)  590080      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 82, 82, 256)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 80, 80, 256)  590080      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 82, 82, 256)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 40, 40, 256)  0           zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 42, 42, 256)  0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 40, 40, 512)  1180160     zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 42, 42, 512)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 40, 40, 512)  2359808     zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 42, 42, 512)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 40, 40, 512)  2359808     zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 42, 42, 512)  0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 20, 20, 512)  0           zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 24, 24, 512)  0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 20, 20, 512)  2359808     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 24, 24, 512)  0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 20, 20, 512)  2359808     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 24, 24, 512)  0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 20, 20, 512)  2359808     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 22, 22, 512)  0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 20, 20, 512)  0           zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
zero_padding2d_19 (ZeroPadding2 (None, 44, 44, 512)  0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 20, 20, 1024) 4719616     zero_padding2d_19[0][0]          
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 20, 20, 1024) 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 20, 20, 1024) 1049600     dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 20, 20, 1024) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
zero_padding2d_20 (ZeroPadding2 (None, 22, 22, 1024) 0           dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 20, 20, 64)   589888      zero_padding2d_20[0][0]          
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 20, 20, 64)   65600       dropout_2[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 20, 20, 64)   4160        conv2d_17[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 20, 20, 64)   4160        conv2d_16[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 20, 20, 128)  0           dense_2[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_22 (ZeroPadding2 (None, 22, 22, 512)  0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
zero_padding2d_21 (ZeroPadding2 (None, 22, 22, 128)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 20, 20, 64)   294976      zero_padding2d_22[0][0]          
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 20, 20, 64)   73792       zero_padding2d_21[0][0]          
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 20, 20, 64)   4160        conv2d_19[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 20, 20, 64)   4160        conv2d_18[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 20, 20, 128)  0           dense_4[0][0]                    
                                                                 dense_3[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_24 (ZeroPadding2 (None, 22, 22, 512)  0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
zero_padding2d_23 (ZeroPadding2 (None, 22, 22, 128)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 20, 20, 64)   294976      zero_padding2d_24[0][0]          
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 20, 20, 64)   73792       zero_padding2d_23[0][0]          
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 20, 20, 64)   4160        conv2d_21[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 20, 20, 64)   4160        conv2d_20[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 20, 20, 128)  0           dense_6[0][0]                    
                                                                 dense_5[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_25 (ZeroPadding2 (None, 22, 22, 128)  0           concatenate_3[0][0]              
__________________________________________________________________________________________________
zero_padding2d_26 (ZeroPadding2 (None, 42, 42, 256)  0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 20, 20, 64)   73792       zero_padding2d_25[0][0]          
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 40, 40, 64)   147520      zero_padding2d_26[0][0]          
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 20, 20, 64)   4160        conv2d_22[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 40, 40, 64)   4160        conv2d_23[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 40, 40, 64)   0           dense_7[0][0]                    
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 40, 40, 128)  0           dense_8[0][0]                    
                                                                 up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
zero_padding2d_27 (ZeroPadding2 (None, 42, 42, 128)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
zero_padding2d_28 (ZeroPadding2 (None, 82, 82, 128)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 40, 40, 64)   73792       zero_padding2d_27[0][0]          
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 80, 80, 64)   73792       zero_padding2d_28[0][0]          
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 40, 40, 64)   4160        conv2d_24[0][0]                  
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 80, 80, 64)   4160        conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 80, 80, 64)   65600       dense_9[0][0]                    
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 80, 80, 128)  0           dense_10[0][0]                   
                                                                 conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
zero_padding2d_29 (ZeroPadding2 (None, 82, 82, 128)  0           concatenate_5[0][0]              
__________________________________________________________________________________________________
zero_padding2d_30 (ZeroPadding2 (None, 162, 162, 64) 0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 80, 80, 64)   73792       zero_padding2d_29[0][0]          
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 160, 160, 64) 36928       zero_padding2d_30[0][0]          
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 80, 80, 64)   4160        conv2d_26[0][0]                  
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 160, 160, 64) 4160        conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 160, 160, 64) 65600       dense_11[0][0]                   
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 160, 160, 128 0           dense_12[0][0]                   
                                                                 conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
zero_padding2d_31 (ZeroPadding2 (None, 162, 162, 128 0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 160, 160, 64) 73792       zero_padding2d_31[0][0]          
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 160, 160, 64) 4160        conv2d_28[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 320, 320, 64) 65600       dense_13[0][0]                   
==================================================================================================
Total params: 22,681,216
Trainable params: 22,681,216
Non-trainable params: 0
__________________________________________________________________________________________________
None
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
main_input0 (InputLayer)        (None, 320, 320, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 322, 322, 3)  0           main_input0[0][0]                
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 320, 320, 64) 1792        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 322, 322, 64) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 320, 320, 64) 36928       zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 322, 322, 64) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 160, 160, 64) 0           zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 162, 162, 64) 0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 160, 160, 128 73856       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 162, 162, 128 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 160, 160, 128 147584      zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 162, 162, 128 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 80, 80, 128)  0           zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 82, 82, 128)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 80, 80, 256)  295168      zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 82, 82, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 80, 80, 256)  590080      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 82, 82, 256)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 80, 80, 256)  590080      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 82, 82, 256)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 40, 40, 256)  0           zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 42, 42, 256)  0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 40, 40, 512)  1180160     zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 42, 42, 512)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 40, 40, 512)  2359808     zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 42, 42, 512)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 40, 40, 512)  2359808     zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 42, 42, 512)  0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 40, 40, 512)  0           zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 44, 44, 512)  0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 40, 40, 512)  2359808     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 44, 44, 512)  0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 40, 40, 512)  2359808     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 44, 44, 512)  0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 40, 40, 512)  2359808     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 42, 42, 512)  0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 40, 40, 512)  0           zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
zero_padding2d_19 (ZeroPadding2 (None, 64, 64, 512)  0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 40, 40, 1024) 4719616     zero_padding2d_19[0][0]          
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 40, 40, 1024) 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 40, 40, 1024) 1049600     dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 40, 40, 1024) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
zero_padding2d_20 (ZeroPadding2 (None, 42, 42, 1024) 0           dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 40, 40, 64)   589888      zero_padding2d_20[0][0]          
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 40, 40, 64)   65600       dropout_2[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 40, 40, 64)   4160        conv2d_17[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 40, 40, 64)   4160        conv2d_16[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 40, 40, 128)  0           dense_2[0][0]                    
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_22 (ZeroPadding2 (None, 42, 42, 512)  0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
zero_padding2d_21 (ZeroPadding2 (None, 42, 42, 128)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 40, 40, 64)   294976      zero_padding2d_22[0][0]          
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 40, 40, 64)   73792       zero_padding2d_21[0][0]          
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 40, 40, 64)   4160        conv2d_19[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 40, 40, 64)   4160        conv2d_18[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 40, 40, 128)  0           dense_4[0][0]                    
                                                                 dense_3[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_24 (ZeroPadding2 (None, 42, 42, 512)  0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
zero_padding2d_23 (ZeroPadding2 (None, 42, 42, 128)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 40, 40, 64)   294976      zero_padding2d_24[0][0]          
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 40, 40, 64)   73792       zero_padding2d_23[0][0]          
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 40, 40, 64)   4160        conv2d_21[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 40, 40, 64)   4160        conv2d_20[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 40, 40, 128)  0           dense_6[0][0]                    
                                                                 dense_5[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_26 (ZeroPadding2 (None, 42, 42, 256)  0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
zero_padding2d_25 (ZeroPadding2 (None, 42, 42, 128)  0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 40, 40, 64)   147520      zero_padding2d_26[0][0]          
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 40, 40, 64)   73792       zero_padding2d_25[0][0]          
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 40, 40, 64)   4160        conv2d_23[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 40, 40, 64)   4160        conv2d_22[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 40, 40, 128)  0           dense_8[0][0]                    
                                                                 dense_7[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_27 (ZeroPadding2 (None, 42, 42, 128)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
zero_padding2d_28 (ZeroPadding2 (None, 82, 82, 128)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 40, 40, 64)   73792       zero_padding2d_27[0][0]          
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 80, 80, 64)   73792       zero_padding2d_28[0][0]          
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 40, 40, 64)   4160        conv2d_24[0][0]                  
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 80, 80, 64)   4160        conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 80, 80, 64)   65600       dense_9[0][0]                    
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 80, 80, 128)  0           dense_10[0][0]                   
                                                                 conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
zero_padding2d_29 (ZeroPadding2 (None, 82, 82, 128)  0           concatenate_5[0][0]              
__________________________________________________________________________________________________
zero_padding2d_30 (ZeroPadding2 (None, 162, 162, 64) 0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 80, 80, 64)   73792       zero_padding2d_29[0][0]          
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 160, 160, 64) 36928       zero_padding2d_30[0][0]          
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 80, 80, 64)   4160        conv2d_26[0][0]                  
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 160, 160, 64) 4160        conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 160, 160, 64) 65600       dense_11[0][0]                   
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 160, 160, 128 0           dense_12[0][0]                   
                                                                 conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
zero_padding2d_31 (ZeroPadding2 (None, 162, 162, 128 0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 160, 160, 64) 73792       zero_padding2d_31[0][0]          
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 160, 160, 64) 4160        conv2d_28[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 320, 320, 64) 65600       dense_13[0][0]                   
==================================================================================================
Total params: 22,681,216
Trainable params: 22,681,216
Non-trainable params: 0
__________________________________________________________________________________________________
None
